I believe this has been fixed. Attempting to reproduce with the latest provider results in a successful `apply`. 

> Note: Minor modifications were made to the original config to remove variable references and add permissions cover a [KMS safety check](https://aws.amazon.com/premiumsupport/knowledge-center/update-key-policy-future/).

### Terraform Config

<details>
  <summary>Show</summary>

```terraform
terraform {
  required_providers {
    aws = {
      source  = "hashicorp/aws"
      version = "~> 4.0"
    }
  }
}

provider "aws" {}

resource "aws_kms_key" "sqs-key" {
  description             = "key to encrypt sqs data for a thing"
  deletion_window_in_days = 14
  policy                  = data.aws_iam_policy_document.optional-sqs-kms-key-policy.json
}

data "aws_iam_policy_document" "optional-sqs-kms-key-policy" {
  # added to prevent "missing principal permissions" error:
  #   Error: error creating KMS Key: MalformedPolicyDocumentException: The new key policy will not allow you to update the key policy in the future.
  #   
  # ref: https://aws.amazon.com/premiumsupport/knowledge-center/update-key-policy-future/
  statement {
    sid    = "RequiredManagement"
    effect = "Allow"
    principals {
      type        = "AWS"
      identifiers = ["*"]
    }
    actions   = ["kms:*"]
    resources = ["*"]
  }

  statement {
    sid    = "AllowSQSAccessToKey"
    effect = "Allow"
    principals {
      identifiers = ["sqs.amazonaws.com"]
      type        = "Service"
    }
    actions = [
      "kms:CreateGrant",
      "kms:ListGrants",
      "kms:RevokeGrant"
    ]
    resources = [
      "*"
    ]

    condition {
      test     = "Bool"
      values   = ["true"]
      variable = "kms:GrantIsForAWSResource"
    }
    condition {
      test     = "StringEquals"
      values   = ["sqs.us-west-2.amazonaws.com"]
      variable = "kms:ViaService"
    }
  }
}
```
</details>

### Reproduction Attempt

```console
$ terraform -v
Terraform v1.3.3
on darwin_arm64
+ provider registry.terraform.io/hashicorp/aws v4.37.0

$ terraform apply -auto-approve
data.aws_iam_policy_document.optional-sqs-kms-key-policy: Reading...
data.aws_iam_policy_document.optional-sqs-kms-key-policy: Read complete after 1s [id=3381652016]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_kms_key.sqs-key will be created
  + resource "aws_kms_key" "sqs-key" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + deletion_window_in_days            = 14
      + description                        = "key to encrypt sqs data for a thing"
      + enable_key_rotation                = false
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "kms:*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "*"
                        }
                      + Resource  = "*"
                      + Sid       = "RequiredManagement"
                    },
                  + {
                      + Action    = [
                          + "kms:RevokeGrant",
                          + "kms:ListGrants",
                          + "kms:CreateGrant",
                        ]
                      + Condition = {
                          + Bool         = {
                              + "kms:GrantIsForAWSResource" = "true"
                            }
                          + StringEquals = {
                              + "kms:ViaService" = "sqs.us-west-2.amazonaws.com"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "sqs.amazonaws.com"
                        }
                      + Resource  = "*"
                      + Sid       = "AllowSQSAccessToKey"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + tags_all                           = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
aws_kms_key.sqs-key: Creating...
aws_kms_key.sqs-key: Creation complete after 5s [id=1ff4a026-c7a3-4abe-a8e1-525f4fd140f0]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
```
